mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/s6e2c3xj.svd
        <!-- REGISTER "OCU_OCCP0" -->
        <register>
          <name>OCU_OCCP0</name>
          <description>OCU ch.0 Compare Value Store Register [HW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "OCU_OCCP1" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP1</name>
          <description>OCU ch.1 Compare Value Store Register [HW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x106</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP2" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP2</name>
          <description>OCU ch.2 Compare Value Store Register [HW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x10A</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP3" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP3</name>
          <description>OCU ch.3 Compare Value Store Register [HW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x10E</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP4" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP4</name>
          <description>OCU ch.4 Compare Value Store Register [HW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x112</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP5" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP5</name>
          <description>OCU ch.5 Compare Value Store Register [HW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x116</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSA10" -->
        <register>
          <name>OCU_OCSA10</name>
          <description>OCU ch.0/1 Control Register A [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x118</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IOP1" -->
            <field>
              <name>IOP1</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(1) value at OCU ch.(1)</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOP0" -->
            <field>
              <name>IOP0</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(0) value at OCU ch.(0)</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE1" -->
            <field>
              <name>IOE1</name>
              <description>Generates interrupt when OCSA.IOP1 is set to 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE0" -->
            <field>
              <name>IOE0</name>
              <description>Generates interrupt when OCSA.IOP0 is set to 1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST1" -->
            <field>
              <name>CST1</name>
              <description>Enables the operation of OCU ch.(1)</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST0" -->
            <field>
              <name>CST0</name>
              <description>Enables the operation of OCU ch.(0)</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSB10" -->
        <register>
          <name>OCU_OCSB10</name>
          <description>OCU ch.0/1 Control Register B [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x119</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x93</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FM4" -->
            <field>
              <name>FM4</name>
              <description>selects FM4 mode for operating mode</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMOD" -->
            <field>
              <name>CMOD</name>
              <description>selects OCU's operation mode in combination with OCSC.MOD0 to MOD5</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD1" -->
            <field>
              <name>OTD1</name>
              <description>Indicates that the RT(1) output pin is in the High-level output state</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD0" -->
            <field>
              <name>OTD0</name>
              <description>Indicates that the RT(0) output pin is in the High-level output state</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSD10" -->
        <register>
          <name>OCU_OCSD10</name>
          <description>OCU ch.0/1 Control Register D [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x11A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OFEX1" -->
            <field>
              <name>OFEX1</name>
              <description>extends the matching determination conditions of the connected FRT with the OCCP(1) register value</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OFEX0" -->
            <field>
              <name>OFEX0</name>
              <description>extends the matching determination conditions of the connected FRT with the OCCP(0) register value</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OEBM1" -->
            <field>
              <name>OEBM1</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OEBM0" -->
            <field>
              <name>OEBM0</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OPBM1" -->
            <field>
              <name>OPBM1</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OPBM0" -->
            <field>
              <name>OPBM0</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCSE1BUFE" -->
            <field>
              <name>OCSE1BUFE</name>
              <description>Enable buffer register function of OCSE(1)</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCSE0BUFE" -->
            <field>
              <name>OCSE0BUFE</name>
              <description>Enable buffer register function of OCSE(0)</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP1BUFE" -->
            <field>
              <name>OCCP1BUFE</name>
              <description>Enable buffer register function of OCCP(1)</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP0BUFE" -->
            <field>
              <name>OCCP0BUFE</name>
              <description>Enable buffer register function of OCCP(0)</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSA32" -->
        <register>
          <name>OCU_OCSA32</name>
          <description>OCU ch.2/3 Control Register A [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x11C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IOP3" -->
            <field>
              <name>IOP3</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(3) value at OCU ch.(3)</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOP2" -->
            <field>
              <name>IOP2</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(2) value at OCU ch.(2)</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE3" -->
            <field>
              <name>IOE3</name>
              <description>Generates interrupt when OCSA.IOP3 is set to 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE2" -->
            <field>
              <name>IOE2</name>
              <description>Generates interrupt when OCSA.IOP2 is set to 1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST3" -->
            <field>
              <name>CST3</name>
              <description>Enables the operation of OCU ch.(3)</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST2" -->
            <field>
              <name>CST2</name>
              <description>Enables the operation of OCU ch.(2)</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSB32" -->
        <register>
          <name>OCU_OCSB32</name>
          <description>OCU ch.2/3 Control Register B [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x11D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x93</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FM4" -->
            <field>
              <name>FM4</name>
              <description>selects FM4 mode for operating mode</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMOD" -->
            <field>
              <name>CMOD</name>
              <description>selects OCU's operation mode in combination with OCSC.MOD0 to MOD5</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD3" -->
            <field>
              <name>OTD3</name>
              <description>Indicates that the RT(3) output pin is in the High-level output state</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD2" -->
            <field>
              <name>OTD2</name>
              <description>Indicates that the RT(2) output pin is in the High-level output state</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSD32" -->
        <register>
          <name>OCU_OCSD32</name>
          <description>OCU ch.2/3 Control Register D [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x11E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OFEX3" -->
            <field>
              <name>OFEX3</name>
              <description>extends the matching determination conditions of the connected FRT with the OCCP(3) register value</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OFEX2" -->
            <field>
              <name>OFEX2</name>
              <description>extends the matching determination conditions of the connected FRT with the OCCP(2) register value</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OEBM3" -->
            <field>
              <name>OEBM3</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OEBM2" -->
            <field>
              <name>OEBM2</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OPBM3" -->
            <field>
              <name>OPBM3</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OPBM2" -->
            <field>
              <name>OPBM2</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCSE3BUFE" -->
            <field>
              <name>OCSE3BUFE</name>
              <description>Enable buffer register function of OCSE(3)</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCSE2BUFE" -->
            <field>
              <name>OCSE2BUFE</name>
              <description>Enable buffer register function of OCSE(2)</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP3BUFE" -->
            <field>
              <name>OCCP3BUFE</name>
              <description>Enable buffer register function of OCCP(3)</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP2BUFE" -->
            <field>
              <name>OCCP2BUFE</name>
              <description>Enable buffer register function of OCCP(2)</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSA54" -->
        <register>
          <name>OCU_OCSA54</name>
          <description>OCU ch.4/5 Control Register A [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x120</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IOP5" -->
            <field>
              <name>IOP5</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(5) value at OCU ch.(5)</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOP4" -->
            <field>
              <name>IOP4</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(4) value at OCU ch.(4)</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE5" -->
            <field>
              <name>IOE5</name>
              <description>Generates interrupt when OCSA.IOP5 is set to 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE4" -->
            <field>
              <name>IOE4</name>
              <description>Generates interrupt when OCSA.IOP4 is set to 1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST5" -->
            <field>
              <name>CST5</name>
              <description>Enables the operation of OCU ch.(5)</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST4" -->
            <field>
              <name>CST4</name>
              <description>Enables the operation of OCU ch.(4)</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSB54" -->
        <register>
          <name>OCU_OCSB54</name>
          <description>OCU ch.4/5 Control Register B [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x121</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x93</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FM4" -->
            <field>
              <name>FM4</name>
              <description>selects FM4 mode for operating mode</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMOD" -->
            <field>
              <name>CMOD</name>
              <description>selects OCU's operation mode in combination with OCSC.MOD0 to MOD5</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD5" -->
            <field>
              <name>OTD5</name>
              <description>Indicates that the RT(5) output pin is in the High-level output state</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD4" -->
            <field>
              <name>OTD4</name>
              <description>Indicates that the RT(4) output pin is in the High-level output state</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
