mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/s6e2c3xj.svd
        <!-- REGISTER "SCFD_FDAS1" -->
        <register>
          <name>SCFD_FDAS1</name>
          <description>Scan Conversion FIFO Data Register for ADSR.FDAS=1 [BHW]</description>
          <alternateRegister>SCFD</alternateRegister>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SD" -->
            <field>
              <name>SD</name>
              <description>Scan conversion result</description>
              <msb>27</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INVL" -->
            <field>
              <name>INVL</name>
              <description>A/D conversion result disable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RS" -->
            <field>
              <name>RS</name>
              <description>Scan conversion start factor</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SC" -->
            <field>
              <name>SC</name>
              <description>Conversion input channel bits</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCIS23" -->
        <register>
          <name>SCIS23</name>
          <description>Scan Conversion Input Selection Register 2 and 3 [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN31" -->
            <field>
              <name>AN31</name>
              <description>Bit15 of SCIS23</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN30" -->
            <field>
              <name>AN30</name>
              <description>Bit14 of SCIS23</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN29" -->
            <field>
              <name>AN29</name>
              <description>Bit13 of SCIS23</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN28" -->
            <field>
              <name>AN28</name>
              <description>Bit12 of SCIS23</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN27" -->
            <field>
              <name>AN27</name>
              <description>Bit11 of SCIS23</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN26" -->
            <field>
              <name>AN26</name>
              <description>Bit10 of SCIS23</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN25" -->
            <field>
              <name>AN25</name>
              <description>Bit9 of SCIS23</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN24" -->
            <field>
              <name>AN24</name>
              <description>Bit8 of SCIS23</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN23" -->
            <field>
              <name>AN23</name>
              <description>Bit7 of SCIS23</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN22" -->
            <field>
              <name>AN22</name>
              <description>Bit6 of SCIS23</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN21" -->
            <field>
              <name>AN21</name>
              <description>Bit5 of SCIS23</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN20" -->
            <field>
              <name>AN20</name>
              <description>Bit4 of SCIS23</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN19" -->
            <field>
              <name>AN19</name>
              <description>Bit3 of SCIS23</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN18" -->
            <field>
              <name>AN18</name>
              <description>Bit2 of SCIS23</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN17" -->
            <field>
              <name>AN17</name>
              <description>Bit1 of SCIS23</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN16" -->
            <field>
              <name>AN16</name>
              <description>Bit0 of SCIS23</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
