mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/s6e2c3xj.svd
        <!-- REGISTER "SSRST" -->
        <register>
          <name>SSRST</name>
          <description>Software Reset Register [BHW]</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWRSTDATLN" -->
            <field>
              <name>SWRSTDATLN</name>
              <description>Software Reset for DAT Line</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWRSTCMDLN" -->
            <field>
              <name>SWRSTCMDLN</name>
              <description>Software Reset for CMD Line</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWRSTALL" -->
            <field>
              <name>SWRSTALL</name>
              <description>Software Reset for All</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SNINTST" -->
        <register>
          <name>SNINTST</name>
          <description>Normal Interrupt Status Register [BHW]</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x9FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRORINT" -->
            <field>
              <name>ERRORINT</name>
              <description>Error Interrupt</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RETUNEEVT" -->
            <field>
              <name>RETUNEEVT</name>
              <description>Re-Tuning Event</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT_C" -->
            <field>
              <name>INT_C</name>
              <description>INT_C Interrupt</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT_B" -->
            <field>
              <name>INT_B</name>
              <description>INT_B Interrupt</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT_A" -->
            <field>
              <name>INT_A</name>
              <description>INT_A Interrupt</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDINT" -->
            <field>
              <name>CARDINT</name>
              <description>Card Interrupt</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDRMV" -->
            <field>
              <name>CARDRMV</name>
              <description>Card Removal</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDINS" -->
            <field>
              <name>CARDINS</name>
              <description>Card Insertion</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BUFRDRDY" -->
            <field>
              <name>BUFRDRDY</name>
              <description>Buffer Read Ready</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BUFWRRDY" -->
            <field>
              <name>BUFWRRDY</name>
              <description>Buffer Write Ready</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>DMA Interrupt</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BLCKGEVNT" -->
            <field>
              <name>BLCKGEVNT</name>
              <description>Block Gap Event</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRSFCMPLT" -->
            <field>
              <name>TRSFCMPLT</name>
              <description>Transfer Complete</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMDCMPLT" -->
            <field>
              <name>CMDCMPLT</name>
              <description>Command Complete</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SEINTST" -->
        <register>
          <name>SEINTST</name>
          <description>Error Interrupt Status Register [BHW]</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x73FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AHBMSTERR" -->
            <field>
              <name>AHBMSTERR</name>
              <description>AHB Master Error</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACMD19ERR" -->
            <field>
              <name>ACMD19ERR</name>
              <description>Auto CMD19 Error</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTACKERR" -->
            <field>
              <name>BTACKERR</name>
              <description>Boot Acknowledge Error</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TUNINGERR" -->
            <field>
              <name>TUNINGERR</name>
              <description>Tuning Error</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADMAERR" -->
            <field>
              <name>ADMAERR</name>
              <description>ADMA Error</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACMD12ERR" -->
            <field>
              <name>ACMD12ERR</name>
              <description>Auto CMD12 Error</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CRTLMTERR" -->
            <field>
              <name>CRTLMTERR</name>
              <description>Current Limit Error</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTEBERR" -->
            <field>
              <name>DTEBERR</name>
              <description>Data End Bit Error</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTCRCERR" -->
            <field>
              <name>DTCRCERR</name>
              <description>Data CRC Error</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTTOERR" -->
            <field>
              <name>DTTOERR</name>
              <description>Data Timeout Error</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMDIDXERR" -->
            <field>
              <name>CMDIDXERR</name>
              <description>Command Index Error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMDEBERR" -->
            <field>
              <name>CMDEBERR</name>
              <description>Command End Bit Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMDCRCERR" -->
            <field>
              <name>CMDCRCERR</name>
              <description>Command CRC Error</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMDTOERR" -->
            <field>
              <name>CMDTOERR</name>
              <description>Command Timeout Error</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SNINTSTE" -->
        <register>
          <name>SNINTSTE</name>
          <description>Normal Interrupt Status Enable Register [BHW]</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RETUNEEVTS" -->
            <field>
              <name>RETUNEEVTS</name>
              <description>Re-Tuning Event Status Enable</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT_CS" -->
            <field>
              <name>INT_CS</name>
              <description>INT_C Status Enable</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT_BS" -->
            <field>
              <name>INT_BS</name>
              <description>INT_B Status Enable</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT_AS" -->
            <field>
              <name>INT_AS</name>
              <description>INT_A Status Enable</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CARDINTS" -->
            <field>
              <name>CARDINTS</name>
              <description>Card Interrupt Status Enable</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CARDRMVS" -->
            <field>
              <name>CARDRMVS</name>
              <description>Card Removal Status Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CARDINSS" -->
            <field>
              <name>CARDINSS</name>
              <description>Card Insertion Status Enable</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUFRDRDYS" -->
            <field>
              <name>BUFRDRDYS</name>
              <description>Buffer Read Ready Status Enable</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUFWRRDYS" -->
            <field>
              <name>BUFWRRDYS</name>
              <description>Buffer Write Ready Status Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAINTS" -->
            <field>
              <name>DMAINTS</name>
              <description>DMA Interrupt Status Enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLCKGEVNTS" -->
            <field>
              <name>BLCKGEVNTS</name>
              <description>Block Gap Event Status Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRSFCMPLTS" -->
            <field>
              <name>TRSFCMPLTS</name>
              <description>Transfer Complete Status Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDCMPLTS" -->
            <field>
              <name>CMDCMPLTS</name>
              <description>Command Complete Status Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SEINTSTE" -->
        <register>
          <name>SEINTSTE</name>
          <description>Error Interrupt Status Enable Register [BHW]</description>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x77FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AHBMSTERRS" -->
            <field>
              <name>AHBMSTERRS</name>
              <description>AHB Master Error Status Enable</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACMD19ERRS" -->
            <field>
              <name>ACMD19ERRS</name>
              <description>Auto CMD19 Error Status Enable</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTACKERRS" -->
            <field>
              <name>BTACKERRS</name>
              <description>Boot Acknowledge Error Status Enable</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TUNINGERRS" -->
            <field>
              <name>TUNINGERRS</name>
              <description>Tuning Error Status Enable</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADMAERRS" -->
            <field>
              <name>ADMAERRS</name>
              <description>ADMA Error Status Enable</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACMD12ERRS" -->
            <field>
              <name>ACMD12ERRS</name>
              <description>Auto CMD Error Status Enable</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRTLMTERRS" -->
            <field>
              <name>CRTLMTERRS</name>
              <description>Current limit Error Status Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTEBERRS" -->
            <field>
              <name>DTEBERRS</name>
              <description>Data End Bit Error Status Enable</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTCRCERRS" -->
            <field>
              <name>DTCRCERRS</name>
              <description>Data CRC Error Status Enable</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTOERRS" -->
            <field>
              <name>DTTOERRS</name>
              <description>Data Timeout Error Status Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDIDXERRS" -->
            <field>
              <name>CMDIDXERRS</name>
              <description>Command Index Error Status Enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDEBERRS" -->
            <field>
              <name>CMDEBERRS</name>
              <description>Command End Bit Error Status Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDCRCERRS" -->
            <field>
              <name>CMDCRCERRS</name>
              <description>Command CRC Error Status Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDTOERRS" -->
            <field>
              <name>CMDTOERRS</name>
              <description>Command Timeout Error Status Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
